{
  "project1": {
    "title": "Stock Viewer",
    "summary": "Developed a dynamic stock market platform showcasing near real-time data for NASDAQ, S&P 500, and Dow Jones indices prominently on the main dashboard. The site provides users with live market news, trending symbols, and features a comprehensive widget for searching stocks, analyzing OHLCV data, and managing custom watchlists. Leveraging React for the frontend and Node.js for the backend, the platform seamlessly integrates two diverse APIs to ensure continuous data availability and persistence.",
    "skills": ["React", "Nodejs", "Expressjs", "RestApi", "Css"],
    "link": "https://stock-page-client.vercel.app",
    "gitlink": "https://github.com/DexterW1/StockPageReactJS",
    "imgSrc": "/images/stockwatcher.png",
    "imgArr": [
      "/images/stockwatcher.png",
      "/images/stockwatcher2.png",
      "/images/stockwatcher3.png"
    ]
  },
  "project2": {
    "title": "Spotify Wrap",
    "summary": "This project is a web application built with React that utilizes the Spotify API to provide users with insights into their music preferences. Users can view their favorite artists and tracks over different time frames and explore detailed audio analysis of their music. Additionally, the application offers personalized recommendations based on the user's listening habits.",
    "skills": ["React", "Nodejs", "Expressjs", "RestApi", "Css"],
    "gitlink": "https://github.com/DexterW1/SpotifyWrap",
    "imgSrc": "/images/spotifywrap1.png",
    "imgArr": [
      "/images/spotifywrap1.png",
      "/images/spotifywrap12.png",
      "/images/spotifywrap3.png",
      "/images/spotifywrap4.png"
    ]
  },
  "project3": {
    "title": "Traffic Accident Analytics",
    "summary": "Contributed to a group project analyzing 7.7 million traffic accidents in the U.S. from 2016-2022. Developed graphs highlighting accident-prone areas and visibility levels, aiding search features by location, and accident management. Also enhanced the interface with pagination for easier data navigation.",
    "skills": ["React", "Nodejs", "Expressjs", "RestApi", "Css", "Bootstrap"],
    "gitlink": "https://github.com/DexterW1/Traffic-Accident-Analytics",
    "imgSrc": "/images/traffic1.png",
    "imgArr": [
      "/images/traffic1.png",
      "/images/traffic2.png",
      "/images/traffic3.png"
    ]
  },
  "project4": {
    "title": "Weatherio",
    "summary": "Crafted a dynamic weather application using fundamental technologies - HTML, CSS, and JavaScript. The app leverages two distinct APIs to present comprehensive weather data, including a 5-day forecast, the next 8-hour breakdown, and current weather details such as wind conditions, air quality, and more. Built entirely with front-end technologies, this project offers a user-friendly interface to retrieve and display essential weather information.",
    "skills": ["Html", "Css", "Javascript"],
    "link": "https://dexterw1.github.io/Weatherio/",
    "gitlink": "https://github.com/DexterW1/Weatherio",
    "imgSrc": "/images/weatherio.png",
    "imgArr": ["/images/weatherio.png", "/images/weatherio2.png"]
  },
  "project5": {
    "title": "Nutripair",
    "summary": "Nutripair is the current company I am working for, our mission is to help people find the best food for their dietary needs while simultaneously helping local restauraunts increase revenue & attract diverse customers",
    "skills": [
      "React-Native",
      "Typescript",
      "S3",
      "Figma",
      "Cognito",
      "Rds",
      "Gateway"
    ],
    "link": "https://dexterw1.github.io/Weatherio/",
    "gitlink": "https://github.com/DexterW1/Weatherio",
    "imgSrc": "/images/weatherio.png",
    "imgArr": ["/images/weatherio.png", "/images/weatherio2.png"]
  }
}
