{
  "project1": {
    "title": "Stock Viewer",
    "summary": "Developed a dynamic stock market platform that displays near real-time data for NASDAQ, S&P 500, and Dow Jones. The platform offers near-live market news, trending stocks, and includes a powerful widget for searching stocks, analyzing OHLCV data, and managing custom watchlists. Built with React for the frontend and Node.js for the backend, it integrates two different APIs to ensure continuous and reliable data availability.",
    "skills": ["React", "Nodejs", "Expressjs", "RestApi", "Css"],
    "link": "https://stock-page-client.vercel.app",
    "gitlink": "https://github.com/DexterW1/StockPageReactJS",
    "imgSrc": "/images/stockwatcher.png",
    "imgArr": [
      "/images/stockwatcher.png",
      "/images/stockwatcher2.png",
      "/images/stockwatcher3.png"
    ]
  },
  "project2": {
    "title": "Spotify Wrap",
    "summary": "This project is a web application built with React that utilizes the Spotify API to provide users with insights into their music preferences. Users can view their favorite artists and tracks over different time frames and explore detailed audio analysis of their music. Additionally, the application offers personalized recommendations based on the user's listening habits.",
    "credits": "The UI design of this project was heavily inspired by Brittany Chiang's Spotify Profile. While I drew design inspiration from her work, all the code was written independently without copying any of her code. Additionally, this projects analytics was also inspired by Spotify's annual 'Wrapped' feature.",
    "creditLink": "https://spotify-profile.herokuapp.com/",
    "skills": ["React", "Nodejs", "Expressjs", "RestApi", "Css"],
    "gitlink": "https://github.com/DexterW1/SpotifyWrap",
    "imgSrc": "/images/spotifywrap1.png",
    "imgArr": [
      "/images/spotifywrap1.png",
      "/images/spotifywrap12.png",
      "/images/spotifywrap3.png",
      "/images/spotifywrap4.png"
    ]
  },
  "project3": {
    "title": "Traffic Accident Analytics",
    "summary": "A group project analyzing over 7.7 million traffic accidents in the U.S. from 2016-2022. Developed graphs highlighting accident-prone areas and visibility levels, aiding search features by location, and accident management. Also enhanced the interface with pagination for easier data navigation.",
    "skills": ["React", "Nodejs", "Expressjs", "RestApi", "Css", "Bootstrap"],
    "gitlink": "https://github.com/DexterW1/Traffic-Accident-Analytics",
    "imgSrc": "/images/traffic1.png",
    "imgArr": [
      "/images/traffic1.png",
      "/images/traffic2.png",
      "/images/traffic3.png"
    ]
  },
  "project4": {
    "title": "Weatherio",
    "summary": "Crafted a dynamic weather application using fundamental technologies - HTML, CSS, and JavaScript. The app leverages two distinct APIs to present comprehensive weather data, including a 5-day forecast, the next 8-hour breakdown, and current weather details such as wind conditions, air quality, and more. Built entirely with front-end technologies, this project offers a user-friendly interface to retrieve and display essential weather information.",
    "credits": "The design of this project was heavily inspired by codewithsadee. However, all the code was written independently without copying any of their code. I mainly took inspiration from the design and implemented it with my own code.",
    "creditLink": "https://www.youtube.com/watch?v=QMwyNnjAils&t=156s",
    "skills": ["Html", "Css", "Javascript"],
    "link": "https://dexterw1.github.io/Weatherio/",
    "gitlink": "https://github.com/DexterW1/Weatherio",
    "imgSrc": "/images/weatherio.png",
    "imgArr": ["/images/weatherio.png", "/images/weatherio2.png"]
  },
  "project5": {
    "title": "Nutripair",
    "summary": "Nutripair is the current company I am working for, our mission is to help people find the best food for their dietary needs while simultaneously helping local restauraunts increase revenue & attract diverse customers",
    "skills": [
      "React-Native",
      "Typescript",
      "S3",
      "Figma",
      "Cognito",
      "Rds",
      "Gateway"
    ],
    "link": "https://dexterw1.github.io/Weatherio/",
    "gitlink": "https://github.com/DexterW1/Weatherio",
    "imgSrc": "/images/weatherio.png",
    "imgArr": ["/images/weatherio.png", "/images/weatherio2.png"]
  }
}
